{"data":{"site":{"siteMetadata":{"title":"cJaredm Dev Blog","author":"Jared Mortenson"}},"markdownRemark":{"id":"2cb0735e-2a1c-5257-96dd-c797c006aa6f","excerpt":"Finally! I deployed my first ever version 1 project. I’ve started\nmany projects before but hadn’t pushed thru to get them published and live.\nThis time I did it…","html":"<p>Finally! I deployed my first ever version 1 project. I’ve started\nmany projects before but hadn’t pushed thru to get them published and live.\nThis time I did it.</p>\n<p><img src=\"https://media.giphy.com/media/pVM4xuseBY0oIcK2Yp/giphy.gif\" alt=\"I did it!\"></p>\n<h3>What’s the story?</h3>\n<p>Last year I had been looking for projects to build, maybe something that would\nend up making me money. I asked several family and friends for ideas. I\nlistened to podcasts about side hustles and these types of projects, or\nstart-ups. I found that most often they stumble into a good business idea.</p>\n<p>For instance there was a story of a company making software for plumbers to\nfind customers. They made a great project and had businesses trying to\nuse them but many were back out and disappear. They decided to look into how\nthese businesses were using their product. They found that these small\nbusinesses were struggling with other things and would end up bailing on\ntheir product or not giving it enough attention. Their main issue was\norganizing themselves and tracking paper work.</p>\n<p>The business pivoted and focused on helping small businesses with their\npaperwork and tracking. They became a huge success after stumbling onto\nthe need of their customers.</p>\n<p>This is what I was trying to do. I found a friend that has a manufacturing\nbusiness as a machine shop machining parts from metals. He told me they\nhave poor order/part tracking and would love to have something simple.\nOf course that kind of software already exists but not specific to his\nindustry that also doesn’t have a ton of things he doesn’t want to pay for.\nI worked on it for the last 3-4 months and finally deployed a week ago!</p>\n<h3>What is it?</h3>\n<p>I built a a customized version of a kanban board specific to his shop/industry.\nPretty simple at first glance, a drag and drop list of todos with specific\nmachines to do them on and a finished section. I built on that idea and\nfeatures as I went. Soon I’ll have analytics built in so that he can look\nback and see what employees are working the most efficiently, what customers\nprovide the most profits, what parts are loosing them money, etc.</p>\n<p><img src=\"./Job_Tracker.png\" alt=\"I did it!\"></p>\n<h3>Conclusion</h3>\n<p>He already started showing his team and will start utilizing it next week.\nBecause it was a success he brought me another idea of an app to build for\nhis sisters company that they’ll pay for in full, where this current project\nI own and will be charging for monthly and start selling to other shops.</p>","frontmatter":{"title":"Deployed!","date":"May 15, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2019-05-29-side-projects/","previous":{"fields":{"slug":"/2019-04-24-how-i-got-started/"},"frontmatter":{"title":"How I Got Started"}},"next":{"fields":{"slug":"/2019-05-15-deployed/"},"frontmatter":{"title":"Level Playing Field"}}}}